In [2]:
import pandas as pd

In [8]:
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index = ["a","b","c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index = ["a","b","c","d"]),
}
pd.DataFrame(d) #Aligned by lables

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [9]:
pd.DataFrame(d, index=["d", "b", "a"], columns=["two", "three"])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [10]:
pd.DataFrame(d, index=["d", "b", "a"], columns=["two", "one"])

   two  one
d  4.0  NaN
b  2.0  2.0
a  1.0  1.0

In [11]:
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}

pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [13]:
d = {"one": [1.0, 2.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}

pd.DataFrame(d) #Lists and arrays must be of same length

ValueError: All arrays must be of the same length

In [15]:
import numpy as np

In [18]:
data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])
data[:] = [(1, 2.0, "Hello"), (2, 3.0, "World")] #NAFAHMIDAM

pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [20]:
data = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]

pd.DataFrame(data) #from a list of dictionaries

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [23]:
pd.DataFrame( #NAFAHMIDAM
    {
        ("a", "b"): {("A", "B"): 1, ("A", "C"): 2},
        ("a", "a"): {("A", "C"): 3, ("A", "B"): 4},
        ("a", "c"): {("A", "B"): 5, ("A", "C"): 6},
        ("b", "a"): {("A", "C"): 7, ("A", "B"): 8},
        ("b", "b"): {("A", "D"): 9, ("A", "B"): 10},
    }
) #Usign a dictionary of tuples

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [26]:
ser = pd.Series(range(3), index=list("abc"), name="ser")

pd.DataFrame(ser) #Look at the index

   ser
a    0
b    1
c    2

In [25]:
ser

a    0
b    1
c    2
Name: ser, dtype: int64

In [33]:
#From a list of namedtuple
from collections import namedtuple

Point = namedtuple("Point", "x y")

pd.DataFrame([Point(0, 0), Point(0, 3), (2, 3)]) #NAFAHMIDAM

   x  y
0  0  0
1  0  3
2  2  3

In [37]:
# From a list of dataclasses

from dataclasses import make_dataclass

Point = make_dataclass("Point", [("x", int), ("y", int)])

pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)]) #NAFAHMIDAM
# Passing a list of dataclasses is equivalent to passing a list of dictionaries.

   x  y
0  0  0
1  0  3
2  2  3

In [38]:
# Creating a DataFrame from a dictionary of lists
data = {"A": [1, 2, 3], "B": [4, 5, 6]}
df = pd.DataFrame.from_dict(data)
df

   A  B
0  1  4
1  2  5
2  3  6

In [40]:
df_2 = pd.DataFrame(data)
df_2

   A  B
0  1  4
1  2  5
2  3  6

In [42]:
# You can also specify the orient parameter to use the keys of the dictionary as row labels:
df = pd.DataFrame.from_dict(data, orient="index", columns=["one", "two", "three"])
df

   one  two  three
A    1    2      3
B    4    5      6

In [44]:
data = np.array([(1, 2.0, "Hello"), (2, 3.0, "World")],
                dtype=[("A", "i4"), ("B", "f4"), ("C", "U10")])
df = pd.DataFrame.from_records(data, index="C")
df #NAFAHMIDAM

       A    B
C
Hello  1  2.0
World  2  3.0

In [57]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, 9]})
df.shape

(3, 3)

In [58]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [59]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [60]:
df.dtypes

A    int64
B    int64
C    int64
dtype: object

In [61]:
df.values

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

In [63]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

In [65]:
df.head()

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [66]:
df.head(3)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [67]:
df.tail()

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [70]:
df.tail(1)

   A  B  C
2  3  6  9

In [71]:
df.sort_values(by='B') # Sort by a single column

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [73]:
df.sort_values(by='B', ascending=False)

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

In [74]:
df.sort_values(by=['A', 'B']) # Sort by multiple columns

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [75]:
df.sort_index() # Sort by index\

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [76]:
df.sort_index(ascending=False)

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

In [77]:
df.transpose()

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [78]:
df.T

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [80]:
df1 = pd.DataFrame(np.random.randn(5, 3), columns=["A", "B", "C"])
df2 = pd.DataFrame(np.random.randn(4, 3), columns=["B", "C", "D"])

df1 + df2

    A         B         C   D
0 NaN -0.023653 -0.501620 NaN
1 NaN  1.959546  1.579831 NaN
2 NaN -0.857824 -0.069876 NaN
3 NaN  2.400058 -1.786811 NaN
4 NaN       NaN       NaN NaN

In [90]:
df = pd.DataFrame(np.random.randint(1, 10, size=(5, 3)), columns=["A", "B", "C"])
series = pd.Series(np.random.randint(1, 10, size=3), index=["A", "B", "C"])

# Subtract the Series from the DataFrame
result = df - series
df

   A  B  C
0  7  9  2
1  2  3  8
2  9  9  6
3  5  3  6
4  9  8  4

In [91]:
series

A    3
B    4
C    6
dtype: int64

In [92]:
result

   A  B  C
0  4  5 -4
1 -1 -1  2
2  6  5  0
3  2 -1  0
4  6  4 -2

In [93]:
# align the Series along the DataFrame's rows (axis=0)
df.sub(series, axis=0)

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN
4 NaN NaN NaN
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN

In [94]:
df * 2 + 1

    A   B   C
0  15  19   5
1   5   7  17
2  19  19  13
3  11   7  13
4  19  17   9

In [95]:
df1 = pd.DataFrame({"A": [True, False, True], "B": [False, True, True]})
df2 = pd.DataFrame({"A": [False, True, True], "B": [True, True, False]})

df1 & df2

       A      B
0  False  False
1  False   True
2   True  False

In [97]:
df1 = pd.DataFrame({"A": [1, None, 3], "B": [4, 5, 6], "C": [7, 8, 9]})
series = pd.Series([10, 20, 30], index=["A", "B", "C"])

In [98]:
df1

     A  B  C
0  1.0  4  7
1  NaN  5  8
2  3.0  6  9

In [99]:
series

A    10
B    20
C    30
dtype: int64

In [100]:
df1.add(series, axis = 1) #Along with cols

      A   B   C
0  11.0  24  37
1   NaN  25  38
2  13.0  26  39

In [105]:
df1.add(series, axis=0) #Along with rows

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN

In [106]:
df = pd.DataFrame(np.random.randn(5, 3), columns=["A", "B", "C"])

In [109]:
# Hiding the index labels
print(df.to_string(index=False))

        A         B         C
-0.923999  0.880507 -1.019971
 0.351139 -1.446035  1.448530
 0.322904  0.362847  1.160460
 1.873818 -0.527300  1.596745
-0.433595  0.328320  0.725906

In [110]:
# Hiding the column labels
print(df.to_string(header=False, index=False))

-0.923999  0.880507 -1.019971
 0.351139 -1.446035  1.448530
 0.322904  0.362847  1.160460
 1.873818 -0.527300  1.596745
-0.433595  0.328320  0.725906

In [111]:
df

          A         B         C
0 -0.923999  0.880507 -1.019971
1  0.351139 -1.446035  1.448530
2  0.322904  0.362847  1.160460
3  1.873818 -0.527300  1.596745
4 -0.433595  0.328320  0.725906